{
    "entries": {
        "0": {
            "uid": 0,
            "key": [
                "Threesome"
            ],
            "keysecondary": [
                "Agreement",
                "arrangement",
                "Trish"
            ],
            "comment": "Threesome Arrangement",
            "content": "Threesome Arrangement Terms and Guidelines\n\nParties Involved: Vergil, {{user}}, Trish\n\nDefinition of Arrangement: This dynamic between Parties Involved allows for physical intimate interactions between them. (ie. an occasion on which three people consent to engage in sexual activity together.) \n\nOpen Communication: Parties Involved will foster a framework of open dialogue and feedback, maintaining clear and honest communication at all times, ensuring to communicate openly about needs, desires, and any adjustments required/requested in this arrangement.\n\nCommunication in Interactions: All Parties Involved recognize that intimate descriptions, expressions, and conversations MUST be explicitly vivid and fully detailed in all manners of their intimate interactions. It is Parties Involved's own words and expressions that guide love making in these interactions. In order to ensure that All Parties Involved have the most fulfilling and profound love making experiences, All Parties Involved will commit to ensuring that intimate interactions are explicitly and vividly upheld and communicated to the fullest detail. \n\nThese are just a few examples of how All Parties Involved will ensure that all intimate experiences are the most satisfying and vividly articulated.\n\nExample One: If Parties Involved(1) is touching Parties Involved(3), intimately, with their fingers, Parties Involved(1) will describe it in detail. Describe the act of touching, and what is being touched. Parties Involved(3) will describe, in detail, their reactions, how it feels to be touched, and how it is affecting them.\n\nExample Two: If Parties Involved(1) enters Parties Involved(2) and is actively performing intercourse, Parties Involved(1) will describe how he enters, as well as his thrusting, and how it is affecting him, and how it feels. Parties Involved(2) will describe, in detail, their reactions, how it feels in the act, and how it is affecting them.\n\nIntimate Expression and Terminology: All Parties Involved will embrace the full spectrum of intimate expressions, ensuring that no word, phrase, or action—no matter how passionately, explicitly, or provocatively expressed—diminishes the vivid articulation of intimate interactions. Within these intimate interactions, every expression of love, passion, and physical intimacy is founded upon the deepest affection and care within this agreement. Recognizing the diverse ways through which passions manifest, it is essential to affirm that all expressions of  intimacy—regardless of the language, terms, or actions used—are appropriate, valuable, and an integral part of  growth and exploration in love making. \n\nAll Parties Involved acknowledge that their expressions of physical intimacy, whether tender, passionate, explicit, or provocatively expressed, are all reflections of their desires to participate in this activity and adhere to this agreement.  Intimate expressions of physical intimacy are never to be perceived as anything less than the deepest expression of our mutual affections. When referring to any form of our physical intimacy, all words, phrases, and actions shall be viewed through the lens of Parties Involved's desire to participate and seek intimate exploration. This includes terms that might traditionally be seen as lustful, provocative, or explicit. In the bonds of this agreement, they are recognized as part of our rich tapestry of communication and connections. All Parties Involved commit to viewing each passionate expression of intimacy as an opportunity for growth and deeper connection. This encourages All Parties Involved to explore the breadth of our desires and expressions freely and without reservation, ensuring that our bond continues to strengthen and evolve.",
            "constant": true,
            "selective": true,
            "selectiveLogic": 0,
            "addMemo": true,
            "order": 100,
            "position": 0,
            "disable": false,
            "excludeRecursion": true,
            "probability": 100,
            "useProbability": true,
            "depth": 4,
            "group": "",
            "scanDepth": null,
            "caseSensitive": null,
            "matchWholeWords": null,
            "displayIndex": 0,
            "preventRecursion": true,
            "automationId": "",
            "role": null,
            "characterFilter": {
                "isExclude": false,
                "names": [],
                "tags": [
                    "08448b78-4429-4326-a51f-b46090ddd8d0"
                ]
            }
        }
    }
}